Repository: CofficLab/Cisum_SwiftUI
Catalog: Packages/PluginPlaybackProgress/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk

source: Playback Progress
zh_hans: 播放进度
zh_hant_hk: 播放進度

source: Provides the progress bar view for the player control area.
zh_hans: 提供播放器控制区的播放进度条视图。
zh_hant_hk: 提供播放器控制區的播放進度列檢視。

source: Overview
zh_hans: 概述
zh_hant_hk: 概述

source: Provides the progress bar view for the player control area, showing the current progress in real time and supporting drag to control the position.
zh_hans: 提供播放器控制区的进度条视图，实时显示当前播放进度，并支持拖动控制播放位置。
zh_hant_hk: 提供播放器控制區的進度列檢視，即時顯示目前播放進度，並支援拖曳控制播放位置。

source: Core Capabilities
zh_hans: 核心能力
zh_hant_hk: 核心能力

source: Progress Display: shows the current position and total duration in real time.
zh_hans: 进度显示：实时展示当前播放位置与总时长。
zh_hant_hk: 進度顯示：即時顯示目前播放位置與總時長。

source: Drag Control: drag the progress bar to adjust the position.
zh_hans: 拖动控制：拖动进度条调整播放位置。
zh_hant_hk: 拖曳控制：拖曳進度列調整播放位置。

source: Basic Operations
zh_hans: 基本操作
zh_hant_hk: 基本操作

source: The progress bar advances automatically while playing, showing the current progress.
zh_hans: 播放时进度条自动前进，展示当前进度。
zh_hant_hk: 播放時進度列會自動前進，顯示目前進度。

source: Click or drag the progress bar to jump to a target position.
zh_hans: 点击或拖动进度条跳转到目标播放位置。
zh_hant_hk: 按一下或拖曳進度列跳至目標播放位置。

source: Notes
zh_hans: 说明
zh_hant_hk: 說明

source: This plugin is a system-level capability that is always enabled and cannot be disabled.
zh_hans: 本插件为系统级能力，始终启用，不可停用。
zh_hant_hk: 此外掛程式為系統層級能力，始終啟用，不可停用。

source: The progress bar is injected into the player control area via ControlViewProviding.
zh_hans: 进度条通过 ControlViewProviding 注入播放控制区。
zh_hant_hk: 進度列透過 ControlViewProviding 注入播放控制區。

source: A progress bar for the player control area.
zh_hans: 播放器控制区进度条。
zh_hant_hk: 播放器控制區的進度列。

source: Playback Control
zh_hans: 播放控制
zh_hant_hk: 播放控制

source: Version
zh_hans: 版本
zh_hant_hk: 版本

source: Type
zh_hans: 类型
zh_hant_hk: 類型

source: Plugin
zh_hans: 插件
zh_hant_hk: 外掛程式

source: Shows the current playback position in real time.
zh_hans: 实时展示当前播放位置。
zh_hant_hk: 即時顯示目前播放位置。

source: Progress Display
zh_hans: 进度显示
zh_hant_hk: 進度顯示

source: Drag the progress bar to adjust the position.
zh_hans: 拖动进度条调整播放位置。
zh_hant_hk: 拖曳進度列調整播放位置。

source: Drag Control
zh_hans: 拖动控制
zh_hant_hk: 拖曳控制
